PrzemyslawSwiderski/arduino-playground/drone-cam/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_APP_REPRODUCIBLE_BUILD=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESPP_FILE_SYSTEM_PARTITION_LABEL="storage"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_FATFS_LFN_HEAP=y
